INSERT INTO Movies (id, title, release_year)
VALUES (1, 'Звёздные войны: Эпизод IV - Новая надежда', 1977),
       (2, 'Парк Юрского периода', 1993),
       (3, 'Властелин колец: Братство кольца', 2001);

INSERT INTO Actors (id, firstName, lastName)
VALUES (1, 'Марк', 'Хэмилл'),
       (2, 'Харрисон', 'Форд'),
       (3, 'Кэрри', 'Фишер'),
       (4, 'Сэм', 'Нилл'),
       (5, 'Лора', 'Дерн'),
       (6, 'Джефф', 'Голдблюм'),
       (7, 'Элайджа', 'Вуд'),
       (8, 'Иэн', 'МакКеллен'),
       (9, 'Вигго', 'Мортенсен');

INSERT INTO movie_actor (movie_id, actor_id)
VALUES (1, 1),
       (1, 2),
       (1, 3),
       (2, 4),
       (2, 5),
       (2, 6),
       (3, 7),
       (3, 8),
       (3, 9);

INSERT INTO movie_genre (movie_id, genre_id)
VALUES (1, 1),
       (2, 2),
       (3, 3);

INSERT INTO Genres (id, name)
VALUES (1, 'Фантастика'),
       (2, 'Приключения'),
       (3, 'Фэнтези');